Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sefc.h
/*
 * Component description for SEFC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-10T14:22:36Z */
#ifndef _PIC32CXMTC_SEFC_COMPONENT_H_
#define _PIC32CXMTC_SEFC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SEFC                                         */
/* ************************************************************************** */

/* -------- SEFC_EEFC_FMR : (SEFC Offset: 0x00) (R/W 32) SEFC Flash Mode Register -------- */
#define SEFC_EEFC_FMR_FRDY_Pos                _UINT32_(0)                                          /* (SEFC_EEFC_FMR) Flash Ready Interrupt Enable Position */
#define SEFC_EEFC_FMR_FRDY_Msk                (_UINT32_(0x1) << SEFC_EEFC_FMR_FRDY_Pos)            /* (SEFC_EEFC_FMR) Flash Ready Interrupt Enable Mask */
#define SEFC_EEFC_FMR_FRDY(value)             (SEFC_EEFC_FMR_FRDY_Msk & (_UINT32_(value) << SEFC_EEFC_FMR_FRDY_Pos)) /* Assigment of value for FRDY in the SEFC_EEFC_FMR register */
#define SEFC_EEFC_FMR_FWS_Pos                 _UINT32_(8)                                          /* (SEFC_EEFC_FMR) Flash Wait State Position */
#define SEFC_EEFC_FMR_FWS_Msk                 (_UINT32_(0xF) << SEFC_EEFC_FMR_FWS_Pos)             /* (SEFC_EEFC_FMR) Flash Wait State Mask */
#define SEFC_EEFC_FMR_FWS(value)              (SEFC_EEFC_FMR_FWS_Msk & (_UINT32_(value) << SEFC_EEFC_FMR_FWS_Pos)) /* Assigment of value for FWS in the SEFC_EEFC_FMR register */
#define SEFC_EEFC_FMR_SCOD_Pos                _UINT32_(16)                                         /* (SEFC_EEFC_FMR) Sequential Code Optimization Disable Position */
#define SEFC_EEFC_FMR_SCOD_Msk                (_UINT32_(0x1) << SEFC_EEFC_FMR_SCOD_Pos)            /* (SEFC_EEFC_FMR) Sequential Code Optimization Disable Mask */
#define SEFC_EEFC_FMR_SCOD(value)             (SEFC_EEFC_FMR_SCOD_Msk & (_UINT32_(value) << SEFC_EEFC_FMR_SCOD_Pos)) /* Assigment of value for SCOD in the SEFC_EEFC_FMR register */
#define SEFC_EEFC_FMR_CLOE_Pos                _UINT32_(26)                                         /* (SEFC_EEFC_FMR) Code Loop Optimization Enable Position */
#define SEFC_EEFC_FMR_CLOE_Msk                (_UINT32_(0x1) << SEFC_EEFC_FMR_CLOE_Pos)            /* (SEFC_EEFC_FMR) Code Loop Optimization Enable Mask */
#define SEFC_EEFC_FMR_CLOE(value)             (SEFC_EEFC_FMR_CLOE_Msk & (_UINT32_(value) << SEFC_EEFC_FMR_CLOE_Pos)) /* Assigment of value for CLOE in the SEFC_EEFC_FMR register */
#define SEFC_EEFC_FMR_ALWAYS1_Pos             _UINT32_(27)                                         /* (SEFC_EEFC_FMR) Always Written to One Position */
#define SEFC_EEFC_FMR_ALWAYS1_Msk             (_UINT32_(0x1) << SEFC_EEFC_FMR_ALWAYS1_Pos)         /* (SEFC_EEFC_FMR) Always Written to One Mask */
#define SEFC_EEFC_FMR_ALWAYS1(value)          (SEFC_EEFC_FMR_ALWAYS1_Msk & (_UINT32_(value) << SEFC_EEFC_FMR_ALWAYS1_Pos)) /* Assigment of value for ALWAYS1 in the SEFC_EEFC_FMR register */
#define SEFC_EEFC_FMR_Msk                     _UINT32_(0x0C010F01)                                 /* (SEFC_EEFC_FMR) Register Mask  */

#define SEFC_EEFC_FMR_ALWAYS_Pos              _UINT32_(27)                                         /* (SEFC_EEFC_FMR Position) Always Written to One */
#define SEFC_EEFC_FMR_ALWAYS_Msk              (_UINT32_(0x1) << SEFC_EEFC_FMR_ALWAYS_Pos)          /* (SEFC_EEFC_FMR Mask) ALWAYS */
#define SEFC_EEFC_FMR_ALWAYS(value)           (SEFC_EEFC_FMR_ALWAYS_Msk & (_UINT32_(value) << SEFC_EEFC_FMR_ALWAYS_Pos)) 

/* -------- SEFC_EEFC_FCR : (SEFC Offset: 0x04) ( /W 32) SEFC Flash Command Register -------- */
#define SEFC_EEFC_FCR_FCMD_Pos                _UINT32_(0)                                          /* (SEFC_EEFC_FCR) Flash Command Position */
#define SEFC_EEFC_FCR_FCMD_Msk                (_UINT32_(0xFF) << SEFC_EEFC_FCR_FCMD_Pos)           /* (SEFC_EEFC_FCR) Flash Command Mask */
#define SEFC_EEFC_FCR_FCMD(value)             (SEFC_EEFC_FCR_FCMD_Msk & (_UINT32_(value) << SEFC_EEFC_FCR_FCMD_Pos)) /* Assigment of value for FCMD in the SEFC_EEFC_FCR register */
#define   SEFC_EEFC_FCR_FCMD_GETD_Val         _UINT32_(0x0)                                        /* (SEFC_EEFC_FCR) Get Flash descriptor  */
#define   SEFC_EEFC_FCR_FCMD_WP_Val           _UINT32_(0x1)                                        /* (SEFC_EEFC_FCR) Write page  */
#define   SEFC_EEFC_FCR_FCMD_WPL_Val          _UINT32_(0x2)                                        /* (SEFC_EEFC_FCR) Write page and lock  */
#define   SEFC_EEFC_FCR_FCMD_EPA_Val          _UINT32_(0x7)                                        /* (SEFC_EEFC_FCR) Erase pages (8, 16, 32, 64)  */
#define   SEFC_EEFC_FCR_FCMD_SLB_Val          _UINT32_(0x8)                                        /* (SEFC_EEFC_FCR) Set lock bit  */
#define   SEFC_EEFC_FCR_FCMD_CLB_Val          _UINT32_(0x9)                                        /* (SEFC_EEFC_FCR) Clear lock bit  */
#define   SEFC_EEFC_FCR_FCMD_GLB_Val          _UINT32_(0xA)                                        /* (SEFC_EEFC_FCR) Get lock bit  */
#define   SEFC_EEFC_FCR_FCMD_SGPB_Val         _UINT32_(0xB)                                        /* (SEFC_EEFC_FCR) Set GPNVM bit  */
#define   SEFC_EEFC_FCR_FCMD_CGPB_Val         _UINT32_(0xC)                                        /* (SEFC_EEFC_FCR) Clear GPNVM bit  */
#define   SEFC_EEFC_FCR_FCMD_GGPB_Val         _UINT32_(0xD)                                        /* (SEFC_EEFC_FCR) Get GPNVM bit  */
#define   SEFC_EEFC_FCR_FCMD_STUI_Val         _UINT32_(0xE)                                        /* (SEFC_EEFC_FCR) Start read unique identifier  */
#define   SEFC_EEFC_FCR_FCMD_SPUI_Val         _UINT32_(0xF)                                        /* (SEFC_EEFC_FCR) Stop read unique identifier  */
#define   SEFC_EEFC_FCR_FCMD_GCALB_Val        _UINT32_(0x10)                                       /* (SEFC_EEFC_FCR) Get CALIB bit  */
#define   SEFC_EEFC_FCR_FCMD_ES_Val           _UINT32_(0x11)                                       /* (SEFC_EEFC_FCR) Erase sector  */
#define   SEFC_EEFC_FCR_FCMD_WUS_Val          _UINT32_(0x12)                                       /* (SEFC_EEFC_FCR) Write user signature  */
#define   SEFC_EEFC_FCR_FCMD_EUS_Val          _UINT32_(0x13)                                       /* (SEFC_EEFC_FCR) Erase user signature  */
#define   SEFC_EEFC_FCR_FCMD_STUS_Val         _UINT32_(0x14)                                       /* (SEFC_EEFC_FCR) Start read user signature  */
#define   SEFC_EEFC_FCR_FCMD_SPUS_Val         _UINT32_(0x15)                                       /* (SEFC_EEFC_FCR) Stop read user signature  */
#define   SEFC_EEFC_FCR_FCMD_SUSP_Val         _UINT32_(0x17)                                       /* (SEFC_EEFC_FCR) Suspend  */
#define   SEFC_EEFC_FCR_FCMD_RES_Val          _UINT32_(0x18)                                       /* (SEFC_EEFC_FCR) Resume  */
#define   SEFC_EEFC_FCR_FCMD_SCK_Val          _UINT32_(0x19)                                       /* (SEFC_EEFC_FCR) Send cryptographic key  */
#define SEFC_EEFC_FCR_FCMD_GETD               (SEFC_EEFC_FCR_FCMD_GETD_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Get Flash descriptor Position  */
#define SEFC_EEFC_FCR_FCMD_WP                 (SEFC_EEFC_FCR_FCMD_WP_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Write page Position  */
#define SEFC_EEFC_FCR_FCMD_WPL                (SEFC_EEFC_FCR_FCMD_WPL_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Write page and lock Position  */
#define SEFC_EEFC_FCR_FCMD_EPA                (SEFC_EEFC_FCR_FCMD_EPA_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Erase pages (8, 16, 32, 64) Position  */
#define SEFC_EEFC_FCR_FCMD_SLB                (SEFC_EEFC_FCR_FCMD_SLB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Set lock bit Position  */
#define SEFC_EEFC_FCR_FCMD_CLB                (SEFC_EEFC_FCR_FCMD_CLB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Clear lock bit Position  */
#define SEFC_EEFC_FCR_FCMD_GLB                (SEFC_EEFC_FCR_FCMD_GLB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Get lock bit Position  */
#define SEFC_EEFC_FCR_FCMD_SGPB               (SEFC_EEFC_FCR_FCMD_SGPB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Set GPNVM bit Position  */
#define SEFC_EEFC_FCR_FCMD_CGPB               (SEFC_EEFC_FCR_FCMD_CGPB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Clear GPNVM bit Position  */
#define SEFC_EEFC_FCR_FCMD_GGPB               (SEFC_EEFC_FCR_FCMD_GGPB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Get GPNVM bit Position  */
#define SEFC_EEFC_FCR_FCMD_STUI               (SEFC_EEFC_FCR_FCMD_STUI_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Start read unique identifier Position  */
#define SEFC_EEFC_FCR_FCMD_SPUI               (SEFC_EEFC_FCR_FCMD_SPUI_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Stop read unique identifier Position  */
#define SEFC_EEFC_FCR_FCMD_GCALB              (SEFC_EEFC_FCR_FCMD_GCALB_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Get CALIB bit Position  */
#define SEFC_EEFC_FCR_FCMD_ES                 (SEFC_EEFC_FCR_FCMD_ES_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Erase sector Position  */
#define SEFC_EEFC_FCR_FCMD_WUS                (SEFC_EEFC_FCR_FCMD_WUS_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Write user signature Position  */
#define SEFC_EEFC_FCR_FCMD_EUS                (SEFC_EEFC_FCR_FCMD_EUS_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Erase user signature Position  */
#define SEFC_EEFC_FCR_FCMD_STUS               (SEFC_EEFC_FCR_FCMD_STUS_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Start read user signature Position  */
#define SEFC_EEFC_FCR_FCMD_SPUS               (SEFC_EEFC_FCR_FCMD_SPUS_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Stop read user signature Position  */
#define SEFC_EEFC_FCR_FCMD_SUSP               (SEFC_EEFC_FCR_FCMD_SUSP_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Suspend Position  */
#define SEFC_EEFC_FCR_FCMD_RES                (SEFC_EEFC_FCR_FCMD_RES_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Resume Position  */
#define SEFC_EEFC_FCR_FCMD_SCK                (SEFC_EEFC_FCR_FCMD_SCK_Val << SEFC_EEFC_FCR_FCMD_Pos) /* (SEFC_EEFC_FCR) Send cryptographic key Position  */
#define SEFC_EEFC_FCR_FARG_Pos                _UINT32_(8)                                          /* (SEFC_EEFC_FCR) Flash Command Argument Position */
#define SEFC_EEFC_FCR_FARG_Msk                (_UINT32_(0xFFFF) << SEFC_EEFC_FCR_FARG_Pos)         /* (SEFC_EEFC_FCR) Flash Command Argument Mask */
#define SEFC_EEFC_FCR_FARG(value)             (SEFC_EEFC_FCR_FARG_Msk & (_UINT32_(value) << SEFC_EEFC_FCR_FARG_Pos)) /* Assigment of value for FARG in the SEFC_EEFC_FCR register */
#define SEFC_EEFC_FCR_FKEY_Pos                _UINT32_(24)                                         /* (SEFC_EEFC_FCR) Flash Writing Protection Key Position */
#define SEFC_EEFC_FCR_FKEY_Msk                (_UINT32_(0xFF) << SEFC_EEFC_FCR_FKEY_Pos)           /* (SEFC_EEFC_FCR) Flash Writing Protection Key Mask */
#define SEFC_EEFC_FCR_FKEY(value)             (SEFC_EEFC_FCR_FKEY_Msk & (_UINT32_(value) << SEFC_EEFC_FCR_FKEY_Pos)) /* Assigment of value for FKEY in the SEFC_EEFC_FCR register */
#define   SEFC_EEFC_FCR_FKEY_PASSWD_Val       _UINT32_(0x5A)                                       /* (SEFC_EEFC_FCR) The 0x5A value enables the command defined by the bits in the register. If the field is written with a different value, the write is not performed and no action is started.  */
#define SEFC_EEFC_FCR_FKEY_PASSWD             (SEFC_EEFC_FCR_FKEY_PASSWD_Val << SEFC_EEFC_FCR_FKEY_Pos) /* (SEFC_EEFC_FCR) The 0x5A value enables the command defined by the bits in the register. If the field is written with a different value, the write is not performed and no action is started. Position  */
#define SEFC_EEFC_FCR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (SEFC_EEFC_FCR) Register Mask  */


/* -------- SEFC_EEFC_FSR : (SEFC Offset: 0x08) ( R/ 32) SEFC Flash Status Register -------- */
#define SEFC_EEFC_FSR_FRDY_Pos                _UINT32_(0)                                          /* (SEFC_EEFC_FSR) Flash Ready Status (cleared when Flash is busy) Position */
#define SEFC_EEFC_FSR_FRDY_Msk                (_UINT32_(0x1) << SEFC_EEFC_FSR_FRDY_Pos)            /* (SEFC_EEFC_FSR) Flash Ready Status (cleared when Flash is busy) Mask */
#define SEFC_EEFC_FSR_FRDY(value)             (SEFC_EEFC_FSR_FRDY_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_FRDY_Pos)) /* Assigment of value for FRDY in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_FCMDE_Pos               _UINT32_(1)                                          /* (SEFC_EEFC_FSR) Flash Command Error Status (cleared on read) Position */
#define SEFC_EEFC_FSR_FCMDE_Msk               (_UINT32_(0x1) << SEFC_EEFC_FSR_FCMDE_Pos)           /* (SEFC_EEFC_FSR) Flash Command Error Status (cleared on read) Mask */
#define SEFC_EEFC_FSR_FCMDE(value)            (SEFC_EEFC_FSR_FCMDE_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_FCMDE_Pos)) /* Assigment of value for FCMDE in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_FLOCKE_Pos              _UINT32_(2)                                          /* (SEFC_EEFC_FSR) Flash Lock Error Status (cleared on read or by writing EEFC_FCR) Position */
#define SEFC_EEFC_FSR_FLOCKE_Msk              (_UINT32_(0x1) << SEFC_EEFC_FSR_FLOCKE_Pos)          /* (SEFC_EEFC_FSR) Flash Lock Error Status (cleared on read or by writing EEFC_FCR) Mask */
#define SEFC_EEFC_FSR_FLOCKE(value)           (SEFC_EEFC_FSR_FLOCKE_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_FLOCKE_Pos)) /* Assigment of value for FLOCKE in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_FLERR_Pos               _UINT32_(3)                                          /* (SEFC_EEFC_FSR) Flash Error Status (cleared when a programming operation starts) Position */
#define SEFC_EEFC_FSR_FLERR_Msk               (_UINT32_(0x1) << SEFC_EEFC_FSR_FLERR_Pos)           /* (SEFC_EEFC_FSR) Flash Error Status (cleared when a programming operation starts) Mask */
#define SEFC_EEFC_FSR_FLERR(value)            (SEFC_EEFC_FSR_FLERR_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_FLERR_Pos)) /* Assigment of value for FLERR in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_WPERR_Pos               _UINT32_(4)                                          /* (SEFC_EEFC_FSR) Write Protection Error Status (cleared on read) Position */
#define SEFC_EEFC_FSR_WPERR_Msk               (_UINT32_(0x1) << SEFC_EEFC_FSR_WPERR_Pos)           /* (SEFC_EEFC_FSR) Write Protection Error Status (cleared on read) Mask */
#define SEFC_EEFC_FSR_WPERR(value)            (SEFC_EEFC_FSR_WPERR_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_WPERR_Pos)) /* Assigment of value for WPERR in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_FLSUSP_Pos              _UINT32_(5)                                          /* (SEFC_EEFC_FSR) Flash Suspended Status (cleared when resuming the programming operation) Position */
#define SEFC_EEFC_FSR_FLSUSP_Msk              (_UINT32_(0x1) << SEFC_EEFC_FSR_FLSUSP_Pos)          /* (SEFC_EEFC_FSR) Flash Suspended Status (cleared when resuming the programming operation) Mask */
#define SEFC_EEFC_FSR_FLSUSP(value)           (SEFC_EEFC_FSR_FLSUSP_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_FLSUSP_Pos)) /* Assigment of value for FLSUSP in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_SECCELSBD_Pos           _UINT32_(16)                                         /* (SEFC_EEFC_FSR) Single ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read) Position */
#define SEFC_EEFC_FSR_SECCELSBD_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_SECCELSBD_Pos)       /* (SEFC_EEFC_FSR) Single ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read) Mask */
#define SEFC_EEFC_FSR_SECCELSBD(value)        (SEFC_EEFC_FSR_SECCELSBD_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_SECCELSBD_Pos)) /* Assigment of value for SECCELSBD in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_MECCELSBD_Pos           _UINT32_(17)                                         /* (SEFC_EEFC_FSR) Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read) Position */
#define SEFC_EEFC_FSR_MECCELSBD_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_MECCELSBD_Pos)       /* (SEFC_EEFC_FSR) Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read) Mask */
#define SEFC_EEFC_FSR_MECCELSBD(value)        (SEFC_EEFC_FSR_MECCELSBD_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_MECCELSBD_Pos)) /* Assigment of value for MECCELSBD in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_SECCEMSBD_Pos           _UINT32_(18)                                         /* (SEFC_EEFC_FSR) Single ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read) Position */
#define SEFC_EEFC_FSR_SECCEMSBD_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_SECCEMSBD_Pos)       /* (SEFC_EEFC_FSR) Single ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read) Mask */
#define SEFC_EEFC_FSR_SECCEMSBD(value)        (SEFC_EEFC_FSR_SECCEMSBD_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_SECCEMSBD_Pos)) /* Assigment of value for SECCEMSBD in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_MECCEMSBD_Pos           _UINT32_(19)                                         /* (SEFC_EEFC_FSR) Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read) Position */
#define SEFC_EEFC_FSR_MECCEMSBD_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_MECCEMSBD_Pos)       /* (SEFC_EEFC_FSR) Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read) Mask */
#define SEFC_EEFC_FSR_MECCEMSBD(value)        (SEFC_EEFC_FSR_MECCEMSBD_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_MECCEMSBD_Pos)) /* Assigment of value for MECCEMSBD in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_SECCELSBL_Pos           _UINT32_(20)                                         /* (SEFC_EEFC_FSR) Single ECC Error on LSB Part of the Memory Lock Bits Position */
#define SEFC_EEFC_FSR_SECCELSBL_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_SECCELSBL_Pos)       /* (SEFC_EEFC_FSR) Single ECC Error on LSB Part of the Memory Lock Bits Mask */
#define SEFC_EEFC_FSR_SECCELSBL(value)        (SEFC_EEFC_FSR_SECCELSBL_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_SECCELSBL_Pos)) /* Assigment of value for SECCELSBL in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_MECCELSBL_Pos           _UINT32_(21)                                         /* (SEFC_EEFC_FSR) Multiple ECC Error on LSB Part of the Memory Lock Bits Position */
#define SEFC_EEFC_FSR_MECCELSBL_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_MECCELSBL_Pos)       /* (SEFC_EEFC_FSR) Multiple ECC Error on LSB Part of the Memory Lock Bits Mask */
#define SEFC_EEFC_FSR_MECCELSBL(value)        (SEFC_EEFC_FSR_MECCELSBL_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_MECCELSBL_Pos)) /* Assigment of value for MECCELSBL in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_SECCEMSBL_Pos           _UINT32_(22)                                         /* (SEFC_EEFC_FSR) Single ECC Error on MSB Part of the Memory Lock Bits Position */
#define SEFC_EEFC_FSR_SECCEMSBL_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_SECCEMSBL_Pos)       /* (SEFC_EEFC_FSR) Single ECC Error on MSB Part of the Memory Lock Bits Mask */
#define SEFC_EEFC_FSR_SECCEMSBL(value)        (SEFC_EEFC_FSR_SECCEMSBL_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_SECCEMSBL_Pos)) /* Assigment of value for SECCEMSBL in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_MECCEMSBL_Pos           _UINT32_(23)                                         /* (SEFC_EEFC_FSR) Multiple ECC Error on MSB Part of the Memory Lock Bits Position */
#define SEFC_EEFC_FSR_MECCEMSBL_Msk           (_UINT32_(0x1) << SEFC_EEFC_FSR_MECCEMSBL_Pos)       /* (SEFC_EEFC_FSR) Multiple ECC Error on MSB Part of the Memory Lock Bits Mask */
#define SEFC_EEFC_FSR_MECCEMSBL(value)        (SEFC_EEFC_FSR_MECCEMSBL_Msk & (_UINT32_(value) << SEFC_EEFC_FSR_MECCEMSBL_Pos)) /* Assigment of value for MECCEMSBL in the SEFC_EEFC_FSR register */
#define SEFC_EEFC_FSR_Msk                     _UINT32_(0x00FF003F)                                 /* (SEFC_EEFC_FSR) Register Mask  */


/* -------- SEFC_EEFC_FRR : (SEFC Offset: 0x0C) ( R/ 32) SEFC Flash Result Register -------- */
#define SEFC_EEFC_FRR_FVALUE_Pos              _UINT32_(0)                                          /* (SEFC_EEFC_FRR) Flash Result Value Position */
#define SEFC_EEFC_FRR_FVALUE_Msk              (_UINT32_(0xFFFFFFFF) << SEFC_EEFC_FRR_FVALUE_Pos)   /* (SEFC_EEFC_FRR) Flash Result Value Mask */
#define SEFC_EEFC_FRR_FVALUE(value)           (SEFC_EEFC_FRR_FVALUE_Msk & (_UINT32_(value) << SEFC_EEFC_FRR_FVALUE_Pos)) /* Assigment of value for FVALUE in the SEFC_EEFC_FRR register */
#define SEFC_EEFC_FRR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (SEFC_EEFC_FRR) Register Mask  */


