Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sefc.h
/* -------- SEFC_EEFC_USR : (SEFC Offset: 0x10) (R/W 32) SEFC User Signature Rights Register -------- */
#define SEFC_EEFC_USR_RDENUSB0_Pos            _UINT32_(0)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 0 Position */
#define SEFC_EEFC_USR_RDENUSB0_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB0_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 0 Mask */
#define SEFC_EEFC_USR_RDENUSB0(value)         (SEFC_EEFC_USR_RDENUSB0_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB0_Pos)) /* Assigment of value for RDENUSB0 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB1_Pos            _UINT32_(1)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 1 Position */
#define SEFC_EEFC_USR_RDENUSB1_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB1_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 1 Mask */
#define SEFC_EEFC_USR_RDENUSB1(value)         (SEFC_EEFC_USR_RDENUSB1_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB1_Pos)) /* Assigment of value for RDENUSB1 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB2_Pos            _UINT32_(2)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 2 Position */
#define SEFC_EEFC_USR_RDENUSB2_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB2_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 2 Mask */
#define SEFC_EEFC_USR_RDENUSB2(value)         (SEFC_EEFC_USR_RDENUSB2_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB2_Pos)) /* Assigment of value for RDENUSB2 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB3_Pos            _UINT32_(3)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 3 Position */
#define SEFC_EEFC_USR_RDENUSB3_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB3_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 3 Mask */
#define SEFC_EEFC_USR_RDENUSB3(value)         (SEFC_EEFC_USR_RDENUSB3_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB3_Pos)) /* Assigment of value for RDENUSB3 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB4_Pos            _UINT32_(4)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 4 Position */
#define SEFC_EEFC_USR_RDENUSB4_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB4_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 4 Mask */
#define SEFC_EEFC_USR_RDENUSB4(value)         (SEFC_EEFC_USR_RDENUSB4_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB4_Pos)) /* Assigment of value for RDENUSB4 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB5_Pos            _UINT32_(5)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 5 Position */
#define SEFC_EEFC_USR_RDENUSB5_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB5_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 5 Mask */
#define SEFC_EEFC_USR_RDENUSB5(value)         (SEFC_EEFC_USR_RDENUSB5_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB5_Pos)) /* Assigment of value for RDENUSB5 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB6_Pos            _UINT32_(6)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 6 Position */
#define SEFC_EEFC_USR_RDENUSB6_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB6_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 6 Mask */
#define SEFC_EEFC_USR_RDENUSB6(value)         (SEFC_EEFC_USR_RDENUSB6_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB6_Pos)) /* Assigment of value for RDENUSB6 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_RDENUSB7_Pos            _UINT32_(7)                                          /* (SEFC_EEFC_USR) Read Enable for User Signature Block 7 Position */
#define SEFC_EEFC_USR_RDENUSB7_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_RDENUSB7_Pos)        /* (SEFC_EEFC_USR) Read Enable for User Signature Block 7 Mask */
#define SEFC_EEFC_USR_RDENUSB7(value)         (SEFC_EEFC_USR_RDENUSB7_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB7_Pos)) /* Assigment of value for RDENUSB7 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB0_Pos            _UINT32_(8)                                          /* (SEFC_EEFC_USR) Write Enable for User Signature Block 0 Position */
#define SEFC_EEFC_USR_WRENUSB0_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB0_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 0 Mask */
#define SEFC_EEFC_USR_WRENUSB0(value)         (SEFC_EEFC_USR_WRENUSB0_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB0_Pos)) /* Assigment of value for WRENUSB0 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB1_Pos            _UINT32_(9)                                          /* (SEFC_EEFC_USR) Write Enable for User Signature Block 1 Position */
#define SEFC_EEFC_USR_WRENUSB1_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB1_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 1 Mask */
#define SEFC_EEFC_USR_WRENUSB1(value)         (SEFC_EEFC_USR_WRENUSB1_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB1_Pos)) /* Assigment of value for WRENUSB1 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB2_Pos            _UINT32_(10)                                         /* (SEFC_EEFC_USR) Write Enable for User Signature Block 2 Position */
#define SEFC_EEFC_USR_WRENUSB2_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB2_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 2 Mask */
#define SEFC_EEFC_USR_WRENUSB2(value)         (SEFC_EEFC_USR_WRENUSB2_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB2_Pos)) /* Assigment of value for WRENUSB2 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB3_Pos            _UINT32_(11)                                         /* (SEFC_EEFC_USR) Write Enable for User Signature Block 3 Position */
#define SEFC_EEFC_USR_WRENUSB3_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB3_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 3 Mask */
#define SEFC_EEFC_USR_WRENUSB3(value)         (SEFC_EEFC_USR_WRENUSB3_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB3_Pos)) /* Assigment of value for WRENUSB3 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB4_Pos            _UINT32_(12)                                         /* (SEFC_EEFC_USR) Write Enable for User Signature Block 4 Position */
#define SEFC_EEFC_USR_WRENUSB4_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB4_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 4 Mask */
#define SEFC_EEFC_USR_WRENUSB4(value)         (SEFC_EEFC_USR_WRENUSB4_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB4_Pos)) /* Assigment of value for WRENUSB4 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB5_Pos            _UINT32_(13)                                         /* (SEFC_EEFC_USR) Write Enable for User Signature Block 5 Position */
#define SEFC_EEFC_USR_WRENUSB5_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB5_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 5 Mask */
#define SEFC_EEFC_USR_WRENUSB5(value)         (SEFC_EEFC_USR_WRENUSB5_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB5_Pos)) /* Assigment of value for WRENUSB5 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB6_Pos            _UINT32_(14)                                         /* (SEFC_EEFC_USR) Write Enable for User Signature Block 6 Position */
#define SEFC_EEFC_USR_WRENUSB6_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB6_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 6 Mask */
#define SEFC_EEFC_USR_WRENUSB6(value)         (SEFC_EEFC_USR_WRENUSB6_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB6_Pos)) /* Assigment of value for WRENUSB6 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_WRENUSB7_Pos            _UINT32_(15)                                         /* (SEFC_EEFC_USR) Write Enable for User Signature Block 7 Position */
#define SEFC_EEFC_USR_WRENUSB7_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_WRENUSB7_Pos)        /* (SEFC_EEFC_USR) Write Enable for User Signature Block 7 Mask */
#define SEFC_EEFC_USR_WRENUSB7(value)         (SEFC_EEFC_USR_WRENUSB7_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB7_Pos)) /* Assigment of value for WRENUSB7 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB0_Pos            _UINT32_(16)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 0 Position */
#define SEFC_EEFC_USR_PRIVUSB0_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB0_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 0 Mask */
#define SEFC_EEFC_USR_PRIVUSB0(value)         (SEFC_EEFC_USR_PRIVUSB0_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB0_Pos)) /* Assigment of value for PRIVUSB0 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB1_Pos            _UINT32_(17)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 1 Position */
#define SEFC_EEFC_USR_PRIVUSB1_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB1_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 1 Mask */
#define SEFC_EEFC_USR_PRIVUSB1(value)         (SEFC_EEFC_USR_PRIVUSB1_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB1_Pos)) /* Assigment of value for PRIVUSB1 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB2_Pos            _UINT32_(18)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 2 Position */
#define SEFC_EEFC_USR_PRIVUSB2_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB2_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 2 Mask */
#define SEFC_EEFC_USR_PRIVUSB2(value)         (SEFC_EEFC_USR_PRIVUSB2_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB2_Pos)) /* Assigment of value for PRIVUSB2 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB3_Pos            _UINT32_(19)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 3 Position */
#define SEFC_EEFC_USR_PRIVUSB3_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB3_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 3 Mask */
#define SEFC_EEFC_USR_PRIVUSB3(value)         (SEFC_EEFC_USR_PRIVUSB3_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB3_Pos)) /* Assigment of value for PRIVUSB3 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB4_Pos            _UINT32_(20)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 4 Position */
#define SEFC_EEFC_USR_PRIVUSB4_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB4_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 4 Mask */
#define SEFC_EEFC_USR_PRIVUSB4(value)         (SEFC_EEFC_USR_PRIVUSB4_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB4_Pos)) /* Assigment of value for PRIVUSB4 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB5_Pos            _UINT32_(21)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 5 Position */
#define SEFC_EEFC_USR_PRIVUSB5_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB5_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 5 Mask */
#define SEFC_EEFC_USR_PRIVUSB5(value)         (SEFC_EEFC_USR_PRIVUSB5_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB5_Pos)) /* Assigment of value for PRIVUSB5 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB6_Pos            _UINT32_(22)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 6 Position */
#define SEFC_EEFC_USR_PRIVUSB6_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB6_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 6 Mask */
#define SEFC_EEFC_USR_PRIVUSB6(value)         (SEFC_EEFC_USR_PRIVUSB6_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB6_Pos)) /* Assigment of value for PRIVUSB6 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_PRIVUSB7_Pos            _UINT32_(23)                                         /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 7 Position */
#define SEFC_EEFC_USR_PRIVUSB7_Msk            (_UINT32_(0x1) << SEFC_EEFC_USR_PRIVUSB7_Pos)        /* (SEFC_EEFC_USR) Privileged Access for User Signature Block 7 Mask */
#define SEFC_EEFC_USR_PRIVUSB7(value)         (SEFC_EEFC_USR_PRIVUSB7_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB7_Pos)) /* Assigment of value for PRIVUSB7 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB0_Pos           _UINT32_(24)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 0 Position */
#define SEFC_EEFC_USR_LOCKUSRB0_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB0_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 0 Mask */
#define SEFC_EEFC_USR_LOCKUSRB0(value)        (SEFC_EEFC_USR_LOCKUSRB0_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB0_Pos)) /* Assigment of value for LOCKUSRB0 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB1_Pos           _UINT32_(25)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 1 Position */
#define SEFC_EEFC_USR_LOCKUSRB1_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB1_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 1 Mask */
#define SEFC_EEFC_USR_LOCKUSRB1(value)        (SEFC_EEFC_USR_LOCKUSRB1_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB1_Pos)) /* Assigment of value for LOCKUSRB1 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB2_Pos           _UINT32_(26)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 2 Position */
#define SEFC_EEFC_USR_LOCKUSRB2_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB2_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 2 Mask */
#define SEFC_EEFC_USR_LOCKUSRB2(value)        (SEFC_EEFC_USR_LOCKUSRB2_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB2_Pos)) /* Assigment of value for LOCKUSRB2 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB3_Pos           _UINT32_(27)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 3 Position */
#define SEFC_EEFC_USR_LOCKUSRB3_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB3_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 3 Mask */
#define SEFC_EEFC_USR_LOCKUSRB3(value)        (SEFC_EEFC_USR_LOCKUSRB3_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB3_Pos)) /* Assigment of value for LOCKUSRB3 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB4_Pos           _UINT32_(28)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 4 Position */
#define SEFC_EEFC_USR_LOCKUSRB4_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB4_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 4 Mask */
#define SEFC_EEFC_USR_LOCKUSRB4(value)        (SEFC_EEFC_USR_LOCKUSRB4_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB4_Pos)) /* Assigment of value for LOCKUSRB4 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB5_Pos           _UINT32_(29)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 5 Position */
#define SEFC_EEFC_USR_LOCKUSRB5_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB5_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 5 Mask */
#define SEFC_EEFC_USR_LOCKUSRB5(value)        (SEFC_EEFC_USR_LOCKUSRB5_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB5_Pos)) /* Assigment of value for LOCKUSRB5 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB6_Pos           _UINT32_(30)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 6 Position */
#define SEFC_EEFC_USR_LOCKUSRB6_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB6_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 6 Mask */
#define SEFC_EEFC_USR_LOCKUSRB6(value)        (SEFC_EEFC_USR_LOCKUSRB6_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB6_Pos)) /* Assigment of value for LOCKUSRB6 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_LOCKUSRB7_Pos           _UINT32_(31)                                         /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 7 Position */
#define SEFC_EEFC_USR_LOCKUSRB7_Msk           (_UINT32_(0x1) << SEFC_EEFC_USR_LOCKUSRB7_Pos)       /* (SEFC_EEFC_USR) Lock User Signature Rights for User Signature Block 7 Mask */
#define SEFC_EEFC_USR_LOCKUSRB7(value)        (SEFC_EEFC_USR_LOCKUSRB7_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB7_Pos)) /* Assigment of value for LOCKUSRB7 in the SEFC_EEFC_USR register */
#define SEFC_EEFC_USR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (SEFC_EEFC_USR) Register Mask  */

