Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sefc.h
#define SEFC_EEFC_USR_RDENUSB_Pos             _UINT32_(0)                                          /* (SEFC_EEFC_USR Position) Read Enable for User Signature Block x */
#define SEFC_EEFC_USR_RDENUSB_Msk             (_UINT32_(0xFF) << SEFC_EEFC_USR_RDENUSB_Pos)        /* (SEFC_EEFC_USR Mask) RDENUSB */
#define SEFC_EEFC_USR_RDENUSB(value)          (SEFC_EEFC_USR_RDENUSB_Msk & (_UINT32_(value) << SEFC_EEFC_USR_RDENUSB_Pos)) 
#define SEFC_EEFC_USR_WRENUSB_Pos             _UINT32_(8)                                          /* (SEFC_EEFC_USR Position) Write Enable for User Signature Block x */
#define SEFC_EEFC_USR_WRENUSB_Msk             (_UINT32_(0xFF) << SEFC_EEFC_USR_WRENUSB_Pos)        /* (SEFC_EEFC_USR Mask) WRENUSB */
#define SEFC_EEFC_USR_WRENUSB(value)          (SEFC_EEFC_USR_WRENUSB_Msk & (_UINT32_(value) << SEFC_EEFC_USR_WRENUSB_Pos)) 
#define SEFC_EEFC_USR_PRIVUSB_Pos             _UINT32_(16)                                         /* (SEFC_EEFC_USR Position) Privileged Access for User Signature Block x */
#define SEFC_EEFC_USR_PRIVUSB_Msk             (_UINT32_(0xFF) << SEFC_EEFC_USR_PRIVUSB_Pos)        /* (SEFC_EEFC_USR Mask) PRIVUSB */
#define SEFC_EEFC_USR_PRIVUSB(value)          (SEFC_EEFC_USR_PRIVUSB_Msk & (_UINT32_(value) << SEFC_EEFC_USR_PRIVUSB_Pos)) 
#define SEFC_EEFC_USR_LOCKUSRB_Pos            _UINT32_(24)                                         /* (SEFC_EEFC_USR Position) Lock User Signature Rights for User Signature Block 7 */
#define SEFC_EEFC_USR_LOCKUSRB_Msk            (_UINT32_(0xFF) << SEFC_EEFC_USR_LOCKUSRB_Pos)       /* (SEFC_EEFC_USR Mask) LOCKUSRB */
#define SEFC_EEFC_USR_LOCKUSRB(value)         (SEFC_EEFC_USR_LOCKUSRB_Msk & (_UINT32_(value) << SEFC_EEFC_USR_LOCKUSRB_Pos)) 

/* -------- SEFC_EEFC_KBLR : (SEFC Offset: 0x14) (R/W 32) SEFC Key Bus Lock Register -------- */
#define SEFC_EEFC_KBLR_KBTLUSB0_Pos           _UINT32_(0)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 0 Position */
#define SEFC_EEFC_KBLR_KBTLUSB0_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB0_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 0 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB0(value)        (SEFC_EEFC_KBLR_KBTLUSB0_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB0_Pos)) /* Assigment of value for KBTLUSB0 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB1_Pos           _UINT32_(1)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 1 Position */
#define SEFC_EEFC_KBLR_KBTLUSB1_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB1_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 1 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB1(value)        (SEFC_EEFC_KBLR_KBTLUSB1_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB1_Pos)) /* Assigment of value for KBTLUSB1 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB2_Pos           _UINT32_(2)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 2 Position */
#define SEFC_EEFC_KBLR_KBTLUSB2_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB2_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 2 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB2(value)        (SEFC_EEFC_KBLR_KBTLUSB2_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB2_Pos)) /* Assigment of value for KBTLUSB2 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB3_Pos           _UINT32_(3)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 3 Position */
#define SEFC_EEFC_KBLR_KBTLUSB3_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB3_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 3 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB3(value)        (SEFC_EEFC_KBLR_KBTLUSB3_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB3_Pos)) /* Assigment of value for KBTLUSB3 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB4_Pos           _UINT32_(4)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 4 Position */
#define SEFC_EEFC_KBLR_KBTLUSB4_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB4_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 4 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB4(value)        (SEFC_EEFC_KBLR_KBTLUSB4_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB4_Pos)) /* Assigment of value for KBTLUSB4 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB5_Pos           _UINT32_(5)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 5 Position */
#define SEFC_EEFC_KBLR_KBTLUSB5_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB5_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 5 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB5(value)        (SEFC_EEFC_KBLR_KBTLUSB5_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB5_Pos)) /* Assigment of value for KBTLUSB5 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB6_Pos           _UINT32_(6)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 6 Position */
#define SEFC_EEFC_KBLR_KBTLUSB6_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB6_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 6 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB6(value)        (SEFC_EEFC_KBLR_KBTLUSB6_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB6_Pos)) /* Assigment of value for KBTLUSB6 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_KBTLUSB7_Pos           _UINT32_(7)                                          /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 7 Position */
#define SEFC_EEFC_KBLR_KBTLUSB7_Msk           (_UINT32_(0x1) << SEFC_EEFC_KBLR_KBTLUSB7_Pos)       /* (SEFC_EEFC_KBLR) Key Bus Transfer Lock from User Signature Block 7 Mask */
#define SEFC_EEFC_KBLR_KBTLUSB7(value)        (SEFC_EEFC_KBLR_KBTLUSB7_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB7_Pos)) /* Assigment of value for KBTLUSB7 in the SEFC_EEFC_KBLR register */
#define SEFC_EEFC_KBLR_Msk                    _UINT32_(0x000000FF)                                 /* (SEFC_EEFC_KBLR) Register Mask  */

#define SEFC_EEFC_KBLR_KBTLUSB_Pos            _UINT32_(0)                                          /* (SEFC_EEFC_KBLR Position) Key Bus Transfer Lock from User Signature Block 7 */
#define SEFC_EEFC_KBLR_KBTLUSB_Msk            (_UINT32_(0xFF) << SEFC_EEFC_KBLR_KBTLUSB_Pos)       /* (SEFC_EEFC_KBLR Mask) KBTLUSB */
#define SEFC_EEFC_KBLR_KBTLUSB(value)         (SEFC_EEFC_KBLR_KBTLUSB_Msk & (_UINT32_(value) << SEFC_EEFC_KBLR_KBTLUSB_Pos)) 

/* -------- SEFC_EEFC_WPMR : (SEFC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SEFC_EEFC_WPMR_WPEN_Pos               _UINT32_(0)                                          /* (SEFC_EEFC_WPMR) Write Protection Enable Position */
#define SEFC_EEFC_WPMR_WPEN_Msk               (_UINT32_(0x1) << SEFC_EEFC_WPMR_WPEN_Pos)           /* (SEFC_EEFC_WPMR) Write Protection Enable Mask */
#define SEFC_EEFC_WPMR_WPEN(value)            (SEFC_EEFC_WPMR_WPEN_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SEFC_EEFC_WPMR register */
#define SEFC_EEFC_WPMR_GPNVMWP_Pos            _UINT32_(1)                                          /* (SEFC_EEFC_WPMR) GPNVM Bit Write Protection Position */
#define SEFC_EEFC_WPMR_GPNVMWP_Msk            (_UINT32_(0x1) << SEFC_EEFC_WPMR_GPNVMWP_Pos)        /* (SEFC_EEFC_WPMR) GPNVM Bit Write Protection Mask */
#define SEFC_EEFC_WPMR_GPNVMWP(value)         (SEFC_EEFC_WPMR_GPNVMWP_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_GPNVMWP_Pos)) /* Assigment of value for GPNVMWP in the SEFC_EEFC_WPMR register */
#define SEFC_EEFC_WPMR_LOCKWP_Pos             _UINT32_(2)                                          /* (SEFC_EEFC_WPMR) Lock Bit Write Protection Position */
#define SEFC_EEFC_WPMR_LOCKWP_Msk             (_UINT32_(0x1) << SEFC_EEFC_WPMR_LOCKWP_Pos)         /* (SEFC_EEFC_WPMR) Lock Bit Write Protection Mask */
#define SEFC_EEFC_WPMR_LOCKWP(value)          (SEFC_EEFC_WPMR_LOCKWP_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_LOCKWP_Pos)) /* Assigment of value for LOCKWP in the SEFC_EEFC_WPMR register */
#define SEFC_EEFC_WPMR_ERASEWP_Pos            _UINT32_(3)                                          /* (SEFC_EEFC_WPMR) Erase and Write Protection Position */
#define SEFC_EEFC_WPMR_ERASEWP_Msk            (_UINT32_(0x1) << SEFC_EEFC_WPMR_ERASEWP_Pos)        /* (SEFC_EEFC_WPMR) Erase and Write Protection Mask */
#define SEFC_EEFC_WPMR_ERASEWP(value)         (SEFC_EEFC_WPMR_ERASEWP_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_ERASEWP_Pos)) /* Assigment of value for ERASEWP in the SEFC_EEFC_WPMR register */
#define SEFC_EEFC_WPMR_USRWP_Pos              _UINT32_(4)                                          /* (SEFC_EEFC_WPMR) User Signature Write Protection Position */
#define SEFC_EEFC_WPMR_USRWP_Msk              (_UINT32_(0x1) << SEFC_EEFC_WPMR_USRWP_Pos)          /* (SEFC_EEFC_WPMR) User Signature Write Protection Mask */
#define SEFC_EEFC_WPMR_USRWP(value)           (SEFC_EEFC_WPMR_USRWP_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_USRWP_Pos)) /* Assigment of value for USRWP in the SEFC_EEFC_WPMR register */
#define SEFC_EEFC_WPMR_ERASEWL_Pos            _UINT32_(7)                                          /* (SEFC_EEFC_WPMR) Erase and Write Lock Position */
#define SEFC_EEFC_WPMR_ERASEWL_Msk            (_UINT32_(0x1) << SEFC_EEFC_WPMR_ERASEWL_Pos)        /* (SEFC_EEFC_WPMR) Erase and Write Lock Mask */
#define SEFC_EEFC_WPMR_ERASEWL(value)         (SEFC_EEFC_WPMR_ERASEWL_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_ERASEWL_Pos)) /* Assigment of value for ERASEWL in the SEFC_EEFC_WPMR register */
#define SEFC_EEFC_WPMR_WPKEY_Pos              _UINT32_(8)                                          /* (SEFC_EEFC_WPMR) Write Protection Key Position */
#define SEFC_EEFC_WPMR_WPKEY_Msk              (_UINT32_(0xFFFFFF) << SEFC_EEFC_WPMR_WPKEY_Pos)     /* (SEFC_EEFC_WPMR) Write Protection Key Mask */
#define SEFC_EEFC_WPMR_WPKEY(value)           (SEFC_EEFC_WPMR_WPKEY_Msk & (_UINT32_(value) << SEFC_EEFC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SEFC_EEFC_WPMR register */
#define   SEFC_EEFC_WPMR_WPKEY_PASSWD_Val     _UINT32_(0x454643)                                   /* (SEFC_EEFC_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define SEFC_EEFC_WPMR_WPKEY_PASSWD           (SEFC_EEFC_WPMR_WPKEY_PASSWD_Val << SEFC_EEFC_WPMR_WPKEY_Pos) /* (SEFC_EEFC_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define SEFC_EEFC_WPMR_Msk                    _UINT32_(0xFFFFFF9F)                                 /* (SEFC_EEFC_WPMR) Register Mask  */


/** \brief SEFC register offsets definitions */
#define SEFC_EEFC_FMR_REG_OFST         _UINT32_(0x00)      /* (SEFC_EEFC_FMR) SEFC Flash Mode Register Offset */
#define SEFC_EEFC_FCR_REG_OFST         _UINT32_(0x04)      /* (SEFC_EEFC_FCR) SEFC Flash Command Register Offset */
#define SEFC_EEFC_FSR_REG_OFST         _UINT32_(0x08)      /* (SEFC_EEFC_FSR) SEFC Flash Status Register Offset */
#define SEFC_EEFC_FRR_REG_OFST         _UINT32_(0x0C)      /* (SEFC_EEFC_FRR) SEFC Flash Result Register Offset */
#define SEFC_EEFC_USR_REG_OFST         _UINT32_(0x10)      /* (SEFC_EEFC_USR) SEFC User Signature Rights Register Offset */
#define SEFC_EEFC_KBLR_REG_OFST        _UINT32_(0x14)      /* (SEFC_EEFC_KBLR) SEFC Key Bus Lock Register Offset */
#define SEFC_EEFC_WPMR_REG_OFST        _UINT32_(0xE4)      /* (SEFC_EEFC_WPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SEFC register API structure */
typedef struct
{
  __IO  uint32_t                       SEFC_EEFC_FMR;      /**< Offset: 0x00 (R/W  32) SEFC Flash Mode Register */
  __O   uint32_t                       SEFC_EEFC_FCR;      /**< Offset: 0x04 ( /W  32) SEFC Flash Command Register */
  __I   uint32_t                       SEFC_EEFC_FSR;      /**< Offset: 0x08 (R/   32) SEFC Flash Status Register */
  __I   uint32_t                       SEFC_EEFC_FRR;      /**< Offset: 0x0C (R/   32) SEFC Flash Result Register */
  __IO  uint32_t                       SEFC_EEFC_USR;      /**< Offset: 0x10 (R/W  32) SEFC User Signature Rights Register */
  __IO  uint32_t                       SEFC_EEFC_KBLR;     /**< Offset: 0x14 (R/W  32) SEFC Key Bus Lock Register */
  __I   uint8_t                        Reserved1[0xCC];
  __IO  uint32_t                       SEFC_EEFC_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
} sefc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_SEFC_COMPONENT_H_ */
